//برنامه ای بنویسید که ثانیه را به ساعت تبدیل کند؟(کاربر ثانیه وارد کند و ساعت دقیق را نشان دهد)

//دسته بندی کلاس ها با دستور پکیج
package Primary;
//دستور اولیه برای گرفتن اطلاعات از کاربر
import java.util.Scanner;
//ایجاد کلاس
public class Seconds {
    //متد اصلی که شروع کننده اجرای برنامه است
    public static void main(String[] args) {
        //ایجاد یک شی و گرفتن اطلاعات وارد شده توسط کاربر
        Scanner time = new Scanner(System.in);
        //دستور چاپ
        System.out.print("Enter the elapsed time in seconds:" );
        //تعریف متغیر از نوع صحیح و وارد کردن یک ثانیه دلخواه توسط کاربر
        int Seconds = time.nextInt();
        //تعریف متغیر ساعت از نوع صحیح و تقسیم کردن ثانیه بر 3600 ثانیه وارد شده توسط کاربر
        int hours = Seconds / 3600;
        //تعریف متغیر دقیقه از نوع صحیح و بدست آوردن باقی مانده از ثانیه و تقسیم بر 60 دقیقه
        int minutes = (Seconds % 3600) / 60;
        //تعریف متغیر ثانیه از نوع صحیح و بدست آوردن باقی مانده از ثانیه (باقی مانده بر 60)
        int seconds = Seconds % 60;
        //دستور چاپ(خروجی از ساعت و دقیقه و ثانیه)
        //چاپ یک مقدار صحیح را در یک رشته قرار میدهد(printf)
        //(%d) یک عدد صحیح را به جای این حرف قرار می دهد
        System.out.printf("%d:%d:%d",hours,minutes,seconds);
    }
}